/* No comment provided by engineer. */
"%@ since last back-up" = "%@ ตั้งแต่สำรองข้อมูลล่าสุด";

/* No comment provided by engineer. */
"AC Power" = "ไฟจากสายชาร์จ";

/* No comment provided by engineer. */
"AirPort Connected" = "เปิดการเชื่อมต่อไร้สายแล้ว";

/* No comment provided by engineer. */
"AirPort Disconnected" = "หยุดการเชื่อมต่อไร้สายแล้ว";

/* No comment provided by engineer. */
"Alert! Enabling this option will add HardwareGrowler to your login items" = "แจ้ง! เลือกใช้สิ่งนี้จะเพิ่ม HardwareGrowler ในรายการล็อคอิน";

/* No comment provided by engineer. */
"Allowing this will let HardwareGrowler launch everytime you login, so that it is available for applications which use it at all times" = "ยิมยอมสิ่งนี้จะทำให้ HardwareGrowler เปิดทำงานทุกครั้งที่คุณล็อคอินเข้าใช้ HardwareGrowler จะได้แจ้งทุกอย่างให้คุณรู้";

/* No comment provided by engineer. */
"Back-up took %@" = "ใช้เวลาสำรองข้อมูล %@";

/* No comment provided by engineer. */
"Battery charging" = "กำลังชาร์จ";

/* No comment provided by engineer. */
"Battery Low!" = "แบตเตอรี่เหลือน้อย!";

/* No comment provided by engineer. */
"Battery Low, Please plug the computer in now" = "แบตเตอรี่เหลือน้อย กรุณาเสียบสายชาร์จ";

/* No comment provided by engineer. */
"Battery Power" = "ไฟจากแบตเตอรี่";

/* No comment provided by engineer. */
"Bluetooth Connected" = "เชื่อมต่อบลูทูธแล้ว";

/* No comment provided by engineer. */
"Bluetooth Connection" = "เปิดการเชื่อมต่อบลูทูธแล้ว";

/* No comment provided by engineer. */
"Bluetooth Disconnected" = "ปิดการเชื่อมต่อบลูทูธ";

/* No comment provided by engineer. */
"Bluetooth Disconnection" = "หยุดการเชื่อมต่อบลูทูธแล้ว";

/* No comment provided by engineer. */
"Bluetooth Module on OSX Lion requires 10.7.3" = "การใช้บลูทูธต้องการ OS X Lion เวอร์ชั่นอย่าง 10.7.3";

/* No comment provided by engineer. */
"Bluetooth Monitor" = "ติดตามดูบลูทูธ";

/* No comment provided by engineer. */
"Cancel" = "ยกเลิก";

/* No comment provided by engineer. */
"Canceled after %@" = "ยกเลิกหลังจาก %@";

/* No comment provided by engineer. */
"Caps Lock" = "Caps Lock";

/* No comment provided by engineer. */
"Caps Lock Off" = "Caps Lock ปิด";

/* No comment provided by engineer. */
"Caps Lock On" = "Caps Lock เปิด";

/* Message body on a volume mount notification, clicking it opens the drive in finder */
"Click to open" = "คลิกเพื่อเปิด";

/* No comment provided by engineer. */
"Current Level: %ld%%" = "ระดับปัจจุบัน: %ld%%";

/* No comment provided by engineer. */
"Enabling this option will cause HardwareGrowler to run without showing a dock icon or a menu item.\n\nTo access preferences, tap HardwareGrowler in Launchpad, or open HardwareGrowler in Finder." = "เลือกใช้สิ่งนี้จะทำให้ HardwareGrowler ทำงานโดยไม่มีไอคอนบน Dock หรือแถบเมนู\n\nถ้าต้องการเปิดหน้าตั้งค่า เรียก HardwareGrowler จาก Launchpad หรือ Finder";

/* No comment provided by engineer. */
"Failed after %@" = "ล้มเหลวหลังจาก %@";

/* No comment provided by engineer. */
"Firewire Connected" = "เชื่อมต่อไฟวายแล้ว";

/* No comment provided by engineer. */
"Firewire Connection" = "การเชื่อมต่อไฟวาย";

/* No comment provided by engineer. */
"Firewire Disconnected" = "หยุดการเชื่อมต่อไฟวาย";

/* No comment provided by engineer. */
"Firewire Disconnection" = "การปิดการเชื่อมต่อไฟวาย";

/* No comment provided by engineer. */
"Firewire Monitor" = "ติดตามดูไฟวาย";

/* No comment provided by engineer. */
"First backup, or no previous backup found in the system log" = "สำรองข้อมูลครั้งแรก หรือไม่พบข้อมูลสำรองในบันทึกของระบบ";

/* No comment provided by engineer. */
"FN Key" = "ปุ่ม FN";

/* No comment provided by engineer. */
"FN Key Pressed" = "ปุ่ม FN ถูกกด";

/* No comment provided by engineer. */
"FN Key Released" = "ปุ่ม FN ถูกปล่อย";

/* No comment provided by engineer. */
"General" = "ทั่วไป";

/* Unit names */
"hours" = "ชั่วโมง";

/* No comment provided by engineer. */
"Icon:" = "ไอคอน:";

/* Title for colum in table of ignored volumes */
"Ignored Drives:" = "ไดร์ฟที่ไม่สนใจ";

/* No comment provided by engineer. */
"In order to receive notifications about Bluetooth devices on OSX Lion, please upgrade to 10.7.3 or above" = "เพื่อที่จะรับแจ้งเตือนเกี่ยวกับบลูทูธบน OS X Lion กรุณาอัพเกรดไปเวอร์ชั่น 10.7.3 หรือสูงกว่า";

/* No comment provided by engineer. */
"In order to receive notifications about Phone Devices, please upgrade to OSX Lion 10.7.3 or above" = "เพื่อที่จะรับแจ้งเตือนเกี่ยวกับเครื่องโทรศัพท์บน OS X Lion กรุณาอัพเกรดไปเวอร์ชั่น 10.7.3 หรือสูงกว่า";

/* No comment provided by engineer. */
"Incoming Phone Call" = "มีสายเรียกเข้า";

/* No comment provided by engineer. */
"Incoming SMS" = "มีข้อความเข้า";

/* No comment provided by engineer. */
"Interface:\t%@" = "ช่องทางเชื่อมต่อ:\t%@";

/* The first %@ will be replaced with the interface (en0, en1, etc) second %@ will be replaced by a description of the Ethernet media such as '100BT/full-duplex' */
"Interface:\t%@\nMedia:\t%@" = "ช่องทาง:\t%1$@\nตัวกลาง:\t%2$@";

/* No comment provided by engineer. */
"IP Address Changed" = "เลขที่อยู่ IP เปลี่ยนไป";

/* No comment provided by engineer. */
"IP Addresses Updated" = "ได้เลขที่อยู่ IP ใหม่";

/* No comment provided by engineer. */
"Joined network.\nSSID:\t\t%@\nBSSID:\t%@" = "เชื่อมต่อกับเครือข่ายแล้ว\nSSID:\t\t%1$@\nBSSID:\t%2$@";

/* No comment provided by engineer. */
"Keyboard Monitor" = "ตัวเฝ้าสังเกตคีย์บอร์ด";

/* No comment provided by engineer. */
"Left network %@." = "ออกจากเครือข่าย %@";

/* Unit label for how often to refire the battery status
   Unit names */
"minutes" = "นาที";

/* No comment provided by engineer. */
"Modules" = "โมดูล";

/* No comment provided by engineer. */
"Mounted" = "ถูกเพิ่มเข้าใช้";

/* No comment provided by engineer. */
"Network Link Down" = "การเชื่อมต่อเครือข่ายหาย";

/* No comment provided by engineer. */
"Network Link Up" = "พบการเชื่อมต่อเครือข่าย";

/* No comment provided by engineer. */
"Network Monitor" = "ติดตามดูเครือข่าย";

/* display no icon at all */
"No icon visible" = "ไม่แสดงไอคอน";

/* No comment provided by engineer. */
"No routable IP addresses" = "ไม่มีเลขที่อยู่ IP";

/* Label over list of checkboxes for notifying for certain keys */
"Notify For:" = "แจ้งสำหรับ:";

/* No comment provided by engineer. */
"Num Lock" = "ปุ่ม Num Lock";

/* No comment provided by engineer. */
"Num Lock Off" = "Num Lock ปิด";

/* No comment provided by engineer. */
"Num Lock On" = "Num Lock เปิด";

/* If the string is too long, use O */
"OFF" = "ปิด";

/* No comment provided by engineer. */
"Ok" = "ตกลง";

/* If the string is too long, use I */
"ON" = "เปิด";

/* Format string for On <power type> */
"On %@" = "กำลังใช้ %@";

/* No comment provided by engineer. */
"Open HardwareGrowler Preferences..." = "เปิดการตั้งค่า HardwareGrowler";

/* No comment provided by engineer. */
"Phone Module" = "โมดูลโทรศัพท์";

/* No comment provided by engineer. */
"Phone Module requires OSX Lion 10.7.3 or above" = "โมดูลโทรศัพท์ต้องการ OS X Lion เวอร์ชั่น 10.7.3 หรือสูงกว่า";

/* No comment provided by engineer. */
"Power Changed" = "ไฟชาร์ตเต็มแล้ว";

/* No comment provided by engineer. */
"Power Monitor" = "ติดตามดูแหล่งจ่ายไฟ";

/* No comment provided by engineer. */
"Power Warning" = "คำเตือนแหล่งจ่ายไฟ";

/* No comment provided by engineer. */
"Preferences" = "การตั้งค่า";

/* No comment provided by engineer. */
"Quit HardwareGrowler" = "ปิด HardwareGrowler";

/* Label for checkbox that sets battery status to redisplay every so often */
"Refire battery status" = "แจ้งระดับแบตเตอรี่ซ้ำๆ";

/* Label for box for putting in the amount of time between refire */
"Refire every:" = "แจ้งทุกๆ:";

/* Label for checkbox that sets whether to only show battery status every x minutes when on battery pwoer */
"Refire only on battery" = "แจ้งซ้ำเมื่อใช้ไฟจากแบตเตอรี่เท่านั้น";

/* Unit names */
"seconds" = "วินาที";

/* No comment provided by engineer. */
"Sent when a Bluetooth Device is connected" = "ส่งเมื่ออุปกรณ์บลูทูธเชื่อมต่อ";

/* No comment provided by engineer. */
"Sent when a Bluetooth Device is disconnected" = "ส่งเมื่ออุปกรณ์บลูทูธปิดการเชื่อมต่อ";

/* No comment provided by engineer. */
"Sent when a Firewire Device is connected" = "ส่งเมื่ออุปกรณ์ไฟวายเชื่อมต่อ";

/* No comment provided by engineer. */
"Sent when a Firewire Device is disconnected" = "ส่งเมื่ออุปกรณ์ไฟวายปิดการเชื่อมต่อ";

/* No comment provided by engineer. */
"Sent when a Thunderbolt Device is connected" = "ส่งเมื่ออุปกรณ์ธันเดอร์โบลท์เชื่อมต่อ";

/* No comment provided by engineer. */
"Sent when a Thunderbolt Device is disconnected" = "ส่งเมื่ออุปกรณ์ธันเดอร์โบลท์ปิดการเชื่อมต่อ";

/* No comment provided by engineer. */
"Sent when a USB Device is connected" = "ส่งเมื่ออุปกรณ์ USB เชื่อมต่อ";

/* No comment provided by engineer. */
"Sent when a USB Device is disconnected" = "ส่งเมื่ออุปกรณ์ USB ปิดการเชื่อมต่อ";

/* No comment provided by engineer. */
"Sent when a volume is mounted" = "ส่งเมื่ออุปกรณ์ไดร์ฟ Volume ถูกเพิ่มเข้าใช้";

/* No comment provided by engineer. */
"Sent when a volume is unmounted" = "ส่งเมื่ออุปกรณ์ไดร์ฟ Volume ถูกถอดออก";

/* No comment provided by engineer. */
"Sent when AirPort connects to a network" = "ส่งเมื่อเชื่อมต่อเครือข่ายไร้สาย";

/* No comment provided by engineer. */
"Sent when AirPort disconnects from a network" = "ส่งเมื่อหลุดจากเครือข่ายไร้สาย";

/* No comment provided by engineer. */
"Sent when an Ethernet link goes down" = "ส่งเมื่อเชื่อมต่อเครือข่ายสายแลน";

/* No comment provided by engineer. */
"Sent when an Ethernet link starts" = "ส่งเมื่อหลุดจากเครือข่ายสายแลน";

/* No comment provided by engineer. */
"Sent when the battery is getting low" = "ส่งเมื่อระดับแบตเตอรี่ต่ำ";

/* No comment provided by engineer. */
"Sent when the systems IP address changes" = "ส่งเมื่อตรวจพบว่าเลขที่อยู่ IP เปลี่ยน";

/* No comment provided by engineer. */
"Sent when the type or status of power changed" = "ส่งเมื่อแหล่งจ่ายไฟเปลี่ยน";

/* No comment provided by engineer. */
"Sent when Time Machine failed to back up" = "ส่งเมื่อการสำรองข้อมูลล้มเหลว";

/* No comment provided by engineer. */
"Sent when Time Machine finishes backing up" = "ส่งเมื่อการสำรองข้อมูลเสร็จสิ้น";

/* No comment provided by engineer. */
"Sent when Time Machine is canceled" = "ส่งเมื่อการสำรองข้อมูลถูกยกเลิก";

/* No comment provided by engineer. */
"Sent when Time Machine starts backing up" = "ส่งเมื่อการสำรองข้อมูลเริ่มขึ้น";

/* No comment provided by engineer. */
"Shift Key" = "ปุ่ม Shift";

/* No comment provided by engineer. */
"Shift Key Pressed" = "ปุ่ม Shift ถูกกด";

/* No comment provided by engineer. */
"Shift Key Released" = "ปุ่ม Shift ถูกปล่อย";

/* No comment provided by engineer. */
"Show Connected Devices at Launch" = "แสดงอุปกรณ์ที่เชื่อมต่อเมื่อเปิด";

/* display the icon in both the menubar and the dock */
"Show icon in both" = "แสดงไอคอนทั้งสองที่";

/* display the icon only in the dock */
"Show icon in the dock" = "แสดงไอคอนบน Dock";

/* default option for where the icon should be seen */
"Show icon in the menubar" = "แสดงไอคอนบนแถบเมนู";

/* No comment provided by engineer. */
"Start HardwareGrowler at Login:" = "เปิด HardwareGrowler เมื่อเข้าสู่ระบบ";

/* No comment provided by engineer. */
"There are no preferences available for this monitor." = "ไม่มีการตั้งค่าสำหรับการติดตามดูสิ่งนี้";

/* No comment provided by engineer. */
"This setting will take effect when Hardware Growler restarts" = "การตั้งค่านี้จะมีผลเมื่อปิดแล้วเปิด HardwareGrowler อีกครั้ง";

/* No comment provided by engineer. */
"Thunderbolt Connected" = "มีการเชื่อมต่อธันเดอร์โบลท์";

/* No comment provided by engineer. */
"Thunderbolt Connection" = "การเชื่อมต่อธันเดอร์โบลท์";

/* No comment provided by engineer. */
"Thunderbolt Disconnected" = "หยุดเชื่อมต่อธันเดอร์โบลท์";

/* No comment provided by engineer. */
"Thunderbolt Disconnection" = "การปิดการเชื่อมต่อธันเดอร์โบลท์";

/* No comment provided by engineer. */
"Thunderbolt Monitor" = "ติดตามดูธันเดอร์โบลท์";

/* No comment provided by engineer. */
"Time Machine Canceled" = "การสำรองข้อมูลถูกยกเลิก";

/* No comment provided by engineer. */
"Time Machine Failed" = "การสำรองข้อมูลล้มเหลว";

/* No comment provided by engineer. */
"Time Machine finished" = "การสำรองข้อมูลเสร็จสิ้น";

/* No comment provided by engineer. */
"Time Machine Finished" = "การสำรองข้อมูลเสร็จสิ้น";

/* No comment provided by engineer. */
"Time Machine started" = "การสำรองข้อมูลเริ่มขึ้น";

/* No comment provided by engineer. */
"Time Machine Started" = "การสำรองข้อมูลเริ่มขึ้น";

/* No comment provided by engineer. */
"Time remaining: %lu minutes" = "เวลาที่เหลือ: %lu นาที";

/* No comment provided by engineer. */
"Time to charge: %lu minutes" = "เวลาใช้อัดประจุ: %lu นาที";

/* No comment provided by engineer. */
"TimeMachine Monitor" = "ติดตามดูการสำรองข้อมูล";

/* No comment provided by engineer. */
"Unknown Power Source" = "แหล่งจ่ายไฟที่ไม่รู้จัก";

/* No comment provided by engineer. */
"Unmounted" = "ถูกเอาออก";

/* No comment provided by engineer. */
"Unnamed FireWire Device" = "อุปกรณ์ไฟวายที่ไม่ระบุชื่อ";

/* No comment provided by engineer. */
"Unnamed Thunderbolt Device" = "อุปกรณ์ธันเดอร์โบลท์ที่ไม่รู้จัก";

/* No comment provided by engineer. */
"UPS Power" = "ไฟจากเครื่องสำรองไฟ";

/* No comment provided by engineer. */
"USB 2.0 Bus" = "ช่อง USB 2.0";

/* No comment provided by engineer. */
"USB 3.0 Bus" = "ช่อง USB 3.0";

/* No comment provided by engineer. */
"USB Bus" = "ช่อง USB";

/* No comment provided by engineer. */
"USB Connected" = "มีการเสียบ USB";

/* No comment provided by engineer. */
"USB Connection" = "การเชื่อมต่อ USB";

/* No comment provided by engineer. */
"USB Disconnected" = "สาย USB ถูกถอด";

/* No comment provided by engineer. */
"USB Disconnection" = "ปิดการเชื่อมต่อ USB";

/* No comment provided by engineer. */
"USB Monitor" = "ติดตามดู USB";

/* No comment provided by engineer. */
"Volume Monitor" = "ติดตามดูไดร์ฟ Volume";

/* No comment provided by engineer. */
"Volume Mounted" = "ไดร์ฟ Volume ถูกเพิ่มเข้าใช้";

/* No comment provided by engineer. */
"Volume Unmounted" = "ไดร์ฟ Volume ถูกเอาออก";

/* No comment provided by engineer. */
"Warning! Enabling this option will cause HardwareGrowler to run in the background" = "คำเตือน! เลือกใช้สิ่งนี้จะทำให้ HardwareGrowler ทำงานอยู่เบื้องหลัง";

